/***********************************************************\
 * © 1993 Adobe Systems Incorporated. All rights reserved. *
 *                                                         *
 *   Core Flash Player localizable strings                 *
\***********************************************************/

/////////////////////////////////////////////////////////////
// BLOCK 1: User Interface strings                         //
/////////////////////////////////////////////////////////////

// Shared strings
"GenericDialog_Header"						= "Adobe Flash Player %@";

// Local security dialog
"LocalSecurity_Title"						= "Segurança do Adobe Flash Player";
"LocalSecurity_Line1"						= "O Adobe® Flash® Player interrompeu uma operação potencialmente insegura. O aplicativo local no computador ou na rede:";
"LocalSecurity_Line2"						= "está tentando se comunicar com este local habilitado para Internet:";
"LocalSecurity_Line3"						= "Para permitir que este aplicativo se comunique com a Internet, clique em Configurações.\nVocê deve reiniciar o aplicativo depois de alterar as configurações.";

"LocalSecurity_SettingsBtn"					= "Configurações…";
"LocalSecurity_OKBtn"						= "OK";

// Flash Exception dialog
"ActionScriptErrorLabel"					= "Ocorreu um erro de ActionScript:";
"ExceptionDialog_DismissAllButton"			= "Descartar tudo";
"ExceptionDialog_ContinueButton"			= "Continuar";

// Script taking too long dialog
"StuckScript_Message"						= "Um script neste filme está fazendo com que o Adobe® Flash® Player seja executado lentamente. Se ele continuar a ser executado, seu computador poderá deixar de responder.\n\nDeseja interromper o script?";
"StuckScript_YesBtn"						= "Sim";
"StuckScript_NoBtn"							= "Não";

// Debug or profile connection failed dialog
"DebugFailed_Header"						= "Adobe® Flash® Player";
"DebugFailed_Message"						= "O Adobe Flash Player não conseguiu estabelecer uma conexão com o Depurador ou Gerador de perfil.";

// Debugger connection dialog
"ShowDialogAtLaunchText"					= "Mostrar esta caixa de diálogo durante inicialização";
"ConnectToDebuggerText"						= "Conectar ao depurador";
"DebuggerLocationText"						= "Meu depurador ou aplicativo de host está executando:";
"LocationLocalText"							= "Neste computador (hostlocal)";
"LocationRemoteText"						= "No endereço IP:";
"ContinueButtonTitle"						= "Continuar";

// Can't find preference pane alert
"CantFindPrefPane_Title"					= "Unable to Load Flash Player Preferences Pane";
"CantFindPrefPane_Message"					= "To access your global settings, re-install Adobe Flash Player. It can be downloaded from http://www.adobe.com/go/getflashplayer";

// Create Desktop Shortcuts dialog
// CreateShortcutsLabelBy and AddApplicationPanelLabel have a trailing space intentionally ... for instance, ("by " + "Zynga") to produce "by Zynga"

"CreateShortcutsPanelTitle"					= "Criar atalho de aplicativo";
"AddApplicationPanelTitle"					= "Adicionar ao armazenamento local no Flash Player";
"CreateShortcutsButtonOK"					= "Criar atalho";
"AddApplicationButtonOK"					= "OK";
"CreateShortcutsButtonCancel"				= "Cancelar";
"CreateShortcutsLabelBy"					= "por ";
"AddApplicationPanelLabel"					= "Permitir que este jogo use o armazenamento local? Isso permitirá que ele carregue mais rápido e salve informações neste computador.";
"CreateShortcutsPanelLabel"					= "Criar um atalho de área de trabalho para este aplicativo?";
"AddApplicationPanelLearnMore"				= "Saiba mais";
"CreateShortcutsButtonShortcut"				= "Adicionar atalho à área de trabalho";

// ----------------------------------------------------------
"IDS_FILE_CHOOSER_TITLE"					= "Escolher arquivo(s)";
"IDS_DIR_CHOOSER_TITLE"						= "Escolher pasta";
"IDS_CHOOSER_SELECT_BUTTON"					= "Selecionar";

// ----------------------------------------------------------
"IDS_FILE_UPLOAD_CHOOSER"					= "Selecionar arquivo para upload de ";
"IDS_FILE_UPLOAD_CHOOSER_MULTI_SELECT"		= "Selecionar arquivo(s) para upload de ";
"IDS_FILE_DOWNLOAD_SAVE"					= "Selecionar local para download de ";
"IDS_DOWNLOAD_FILE_SAVE_CLASSIC_PLUGIN"		= "Selecionar local para download";
"IDS_FILE_LOCAL_SAVE"						= "Selecionar arquivo a ser salvo";

// ----------------------------------------------------------

/////////////////////////////////////////////////////////////
// BLOCK 2: Error strings                                  //
/////////////////////////////////////////////////////////////

"IDS_CONSOLE_CASE"							= "-- Provavelmente uma incompatibilidade de caso.";
"IDS_CONSOLE_SANDBOX"						= "*** Violação da área de segurança ***";
"IDS_CONSOLE_NOT_PERMITTED"					= "Conexão com %s interrompida – não permitida de %s";
"IDS_CONSOLE_TITLE"							= "Console de depuração do Flash Player";
"IDS_CONSOLE_FSCOMMAND_HALTED"				= "FSCommand interrompido (AllowScriptAccess é \'%s\'): %s";
"IDS_CONSOLE_URL_HALTED"					= "URL do script interrompido (AllowScriptAccess é \'%s\'): %s";
"IDS_CONSOLE_SECURITY_CONTEXT"				= "SecurityDomain \'%s\' tentou acessar o contexto incompatível \'%s\'";
"IDS_CONSOLE_SECURITY_NULL"					= "SecurityDomain \'%s\' tentou acessar o contexto NULL";
"IDS_CONSOLE_SECURITY_PLAYER"				= "SecurityDomain \'%s\' tentou acessar o contexto de UI do Player";
"IDS_CONSOLE_WARN_NO_PROP"					= "Aviso: \'%s\' não tem a propriedade \'%s\'";
"IDS_CONSOLE_WARN_NOT_A_FUNC"				= "Aviso: %s não é uma função";
"IDS_CONSOLE_WARN_NOT_DEFINED"				= "Aviso: %s não está definido";
"IDS_CONSOLE_WARN_400"						= "Aviso: 400 – solicitação com problema: %s";
"IDS_CONSOLE_WARN_401"						= "Aviso: 401 – não autorizado: %s";
"IDS_CONSOLE_WARN_402"						= "Aviso: 402 – pagamento necessário: %s";
"IDS_CONSOLE_WARN_403"						= "Aviso: 403 - proibido: %s";
"IDS_CONSOLE_WARN_404"						= "Aviso: 404 – não encontrado: %s";
"IDS_CONSOLE_WARN_405"						= "Aviso: 405 – método não permitido, tipo de MIME inválido: %s";
"IDS_CONSOLE_WARN_406"						= "Aviso: 406 – não aceitável: %s";
"IDS_CONSOLE_WARN_500"						= "Aviso: 500 – erro de servidor: %s";
"IDS_CONSOLE_WARN_501"						= "Aviso: 501 – não implementado: %s";
"IDS_CONSOLE_WARN_502"						= "Aviso: 502 – gateway com problema: %s";
"IDS_CONSOLE_WARN_503"						= "Aviso: 503 – sem recursos: %s";
"IDS_CONSOLE_WARN_504"						= "Aviso: 504 – período-limite do gateway: %s";
"IDS_CONSOLE_WARN_505"						= "Aviso: 505 – versão de HTTP não suportada: %s";
"IDS_CONSOLE_WARN_NO_CONNECT"				= "Aviso: não foi possível conectar, %s";
"IDS_CONSOLE_WARN_FAIL_ALLOCATE_URL"		= "Aviso: falha ao alocar o caminho do URL";
"IDS_CONSOLE_WARN_CORRUPT_DATA"				= "Aviso: falha ao analisar dados corrompidos.";
"IDS_CONSOLE_WARN_FAIL_PLACE"				= "Aviso: falha ao colocar objeto na profundidade %d.";
"IDS_CONSOLE_WARN_FAIL_PLACE_MISSING_CHAR" 	= "Aviso: falha ao colocar objeto: caractere ausente";
"IDS_CONSOLE_WARN_FTP_FILE"					= "Aviso: erro de arquivo aberto do FTP, %s";
"IDS_CONSOLE_WARN_HTTP_REQUEST"				= "Aviso: erro de solicitação aberta do HTTP, %s";
"IDS_CONSOLE_WARN_HTTP_QUERY"				= "Aviso: erro de informação de consulta do HTTP, %s";
"IDS_CONSOLE_WARN_HTTP_SEND"				= "Aviso: erro de solicitação de envio do HTTP, %d: %s";
"IDS_CONSOLE_WARN_NET_CONNECT"				= "Aviso: erro de conexão com a Internet, %s";
"IDS_CONSOLE_WARN_NET_OPEN"					= "Aviso: erro de abertura da Internet";
"IDS_CONSOLE_WARN_UNKNOWN_DOWNLOAD_TYPE"	= "Aviso: não é um tipo de download de player conhecido, %s";
"IDS_CONSOLE_WARN_BAD_PORT"					= "Aviso: a porta %d está fora do intervalo permitido.";
"IDS_CONSOLE_WARN_WARNING_LIMIT"			= "Aviso: limite de aviso alcançado de %d";
"IDS_CONSOLE_WARN_UNDECLARED_PROP"			= "Aviso: referência a propriedade não declarada, \'%s\'";
"IDS_CONSOLE_WARN_UNDECLARED_VAR"			= "Aviso: referência a variável não declarada, \'%s\'";
"IDS_CONSOLE_WARN_SOCKET_ERROR"				= "Aviso: erro de soquete, %s";
"IDS_CONSOLE_WARN_STACK"					= "Aviso: estouro de pilha";
"IDS_CONSOLE_WARN_HOST"						= "Aviso: impossível resolver host: %s";
"IDS_CONSOLE_WARN_GENERIC_HOST"				= "Aviso: impossível resolver host";
"IDS_CONSOLE_WARN_EXCEPTION"				= "Aviso: exceção não capturada, %s";
"IDS_CONSOLE_WARN_HTTP_STATUS"				= "Aviso: status de HTTP não reconhecido %d: %s";
"IDS_CONSOLE_WARN_NO_URL"					= "Aviso: sem caminho do URL";
"IDS_CONSOLE_SECURITY_DIALOG"				= "Encontrada a correspondência do domínio de herança - %s está tentando acessar %s";
"IDS_CONSOLE_LOCAL_OUTBOUND"				= "-- SWFs locais não confiáveis não podem entrar em contato com a Internet.";
"IDS_CONSOLE_LOCAL_INBOUND"					= "-- SWFs remotos não podem acessar arquivos locais.";
"IDS_CONSOLE_WARN_AVM1_LOADED_AVM2"			= "Aviso: 505 – versão de HTTP não suportada: %s";
"IDS_CONSOLE_WINDOW_HALTED"					= "URL da janela \'%s\' interrompido (AllowScriptAccess é \'%s\'): %s";
"IDS_CONSOLE_ALLOW_NETWORK"					= "-- Isso se deve ao valor de \'allowNetworking\'.";
"IDS_CONSOLE_NO_POLICY_FILE"				= "Falha ao carregar o arquivo de diretivas de %s";
"IDS_CONSOLE_BAD_POLICY_FILE"				= "[strict] Ignorando o arquivo de diretivas em %s devido a sintaxe incorreta. Consulte http://www.adobe.com/go/strict_policy_files_br para corrigir esse problema.";
"IDS_CONSOLE_PREFIX_OK"						= "OK: ";
"IDS_CONSOLE_PREFIX_WARNING"				= "Aviso: ";
"IDS_CONSOLE_PREFIX_ERROR"					= "Erro: ";
"IDS_CONSOLE_GOOD_POLICY_FILE"				= "Arquivo de diretivas aceito: %s";
"IDS_CONSOLE_BAD_POLICY_FILE_TYPE"			= "[strict] Ignorando o arquivo de diretivas em %s devido ao Content-Type com problemas \'%s\'. Consulte http://www.adobe.com/go/strict_policy_files_br para corrigir esse problema.";
"IDS_CONSOLE_NO_POLICY_FILE_TYPE"			= "[strict] Ignorando o arquivo de diretivas em %s devido ao Content-Type ausente.  Consulte http://www.adobe.com/go/strict_policy_files_br para corrigir esse problema.";
"IDS_CONSOLE_POLICY_FILE_NO_HEADERS"		= "Cabeçalhos de resposta HTTP não disponíveis nesta plataforma. As regras estritas do arquivo de diretivas não podem ser impostas.";
"IDS_CONSOLE_POLICY_FILE_REDIRECT"			= "[strict] Arquivo de diretivas solicitado de %s redirecionado para %s; usará o URL final na determinação do escopo. Visite http://www.adobe.com/go/strict_policy_files_br se isso causar problemas.";
"IDS_CONSOLE_POLICY_FILE_CROSS_DOMAIN"		= "Ignorando o arquivo de diretivas solicitado de %s porque ocorreu um redirecionamento de domínio cruzado para %s.";
"IDS_CONSOLE_TOP_URL"						= "SWF de nível raiz carregado: %s";
"IDS_CONSOLE_META_POLICY_HDR_UNKNOWN"		= "Metadiretiva não reconhecida no cabeçalho HTTP de %s: %s";
"IDS_CONSOLE_META_POLICY_HDR_FTP"			= "O cabeçalho HTTP de %s especifica a metadiretiva \'by-ftp-filename\', que só se aplica a FTP, não a HTTP.";
"IDS_CONSOLE_META_POLICY_HDR_CONFLICT"		= "Metadiretiva conflitante no cabeçalho HTTP de %s: %s";
"IDS_CONSOLE_META_POLICY_HDR_PREV"			= "A metadiretiva %s no cabeçalho HTTP de %s conflita com a metadiretiva %s estabelecida anteriormente";
"IDS_CONSOLE_POLICY_FILE_NONE_THIS_RSP"		= "Ignorando o arquivo de diretivas em %s devido a X-Permitted-Cross-Domain-Policies: none-this-response";
"IDS_CONSOLE_POLICY_FILE_SITE_NONMASTER"	= "Ignorando a marca <site-control> no arquivo de diretivas de %s. Essa marca só é permitida em arquivos de diretivas mestras.";
"IDS_CONSOLE_META_POLICY_BAD_BY_TYPE"		= "Ignorando a marca <site-control> no arquivo de diretivas de %s. A metadiretiva \'by-content-type\' só se aplica a sites HTTP.";
"IDS_CONSOLE_META_POLICY_BAD_BY_FTP"		= "Ignorando a marca <site-control> no arquivo de diretivas de %s. A metadiretiva \'by-ftp-filename\' só se aplica a sites FTP.";
"IDS_CONSOLE_META_POLICY_BAD_THIS_RESPONSE"	= "Ignorando a marca <site-control> no arquivo de diretivas de %s. A metadiretiva \'none-this-response\' só é permitida no cabeçalho de resposta X-Permitted-Cross-Domain-Policies HTTP.";
"IDS_CONSOLE_META_POLICY_FILE_UNKNOWN"		= "Metadiretiva não reconhecida no arquivo de diretivas de %s: %s";
"IDS_CONSOLE_META_POLICY_FILE_PREV"			= "A metadiretiva %s no arquivo de diretivas de %s conflita com a metadiretiva %s estabelecida anteriormente";
"IDS_CONSOLE_META_POLICY_DEFAULT"			= "O domínio %s não especifica uma metadiretiva. Aplicando a metadiretiva padrão \'master-only\'. Essa configuração é obsoleta. Consulte http://www.adobe.com/go/strict_policy_files_br para corrigir esse problema.";
"IDS_CONSOLE_POLICY_FILE_SOCK_NONE_NO"		= "O SWF de %s não pode se conectar a um soquete em seu próprio domínio sem um arquivo de diretivas.  Consulte http://www.adobe.com/go/strict_policy_files_br para corrigir esse problema.";
"IDS_CONSOLE_POLICY_FILE_SOCK_TIMEOUT"		= "Período-limite em %s (em 3 segundos) durante a espera pelo arquivo de diretivas de soquete.  Isso não deve causar problemas, mas consulte http://www.adobe.com/go/strict_policy_files_br para obter uma explicação.";
"IDS_CONSOLE_META_POLICY_IMPLICIT"			= "O domínio %s não especifica explicitamente uma metadiretiva, mas o Content-Type do arquivo de diretivas %s é \'text/x-cross-domain-policy\'.  Aplicando a metadiretiva \'by-content-type\'.";
"IDS_CONSOLE_META_POLICY_REJECT"			= "Ignorando o arquivo de diretivas em %s devido à metadiretiva \'%s\'.";
"IDS_CONSOLE_POLICY_FILE_TOO_BIG"			= "Ignorando o arquivo de diretivas de soquete em %s porque ele é muito grande.  Os arquivos de diretivas de soquete não podem exceder 20 quilobytes.";
"IDS_CONSOLE_MASTER_SELF_INVALIDATED"		= "O arquivo de diretivas em %s invalida suas próprias diretivas <allow-access-from> com a declaração da metadiretiva \'none\'.";
"IDS_CONSOLE_POLICY_FILE_BAD_PORT_SPEC"		= "Ignorando a especificação ilegal do número da porta \'%s\' no arquivo de diretivas em %s";
"IDS_CONSOLE_POLICY_FILE_BAD_ALLOW"			= "Ignorando a tag inválida <%s> do domínio \'%s\' no arquivo de diretivas em %s";
"IDS_CONSOLE_REQUEST_ALLOWED_BY_POLICY"		= "A solicitação de recurso em %s pelo solicitando de %s é permitida devido ao arquivo de diretivas em %s";
"IDS_CONSOLE_REQUEST_DENIED_NO_POLICY"		= "A solicitação de recurso em %s pelo solicitante de %s é negada devido à falta de permissões do arquivo de diretivas.";
"IDS_CONSOLE_SOCKET_UNAVAILABLE"			= "A solicitação de recurso em %s pelo solicitante de %s falhou porque o servidor não foi alcançado.";
"IDS_CONSOLE_NO_ASFUNCTION"					= "Rejeitando o URL %s porque o protocolo \'asfunction:\' só pode ser usado para destinos de link, não para APIs de rede.";
"IDS_CONSOLE_POLICY_BAD_SECURE_ATTR"		= "Ignorando o atributo \'secure\' no arquivo de diretivas de %s. O atributo \'secure\' só é permitido em HTTPS e em arquivos de diretivas de soquete.  Consulte http://www.adobe.com/go/strict_policy_files_br para obter detalhes.";
"IDS_CONSOLE_POLICY_SOCK_SECURE_ATTR"		= "Foi encontrado secure=\'true\' no arquivo de diretivas de %s, mas parece que o host %s não está se referindo ao computador local. Isso pode ser inseguro. Consulte http://www.adobe.com/go/strict_policy_files_br para obter detalhes.";
"IDS_CONSOLE_POLICY_REASON_DATA"			= "Pesquisando <allow-access-from> nos arquivos de diretiva para autorizar carregamento de dados do recurso em %s pelo solicitante de %s";
"IDS_CONSOLE_POLICY_REASON_HEADERS"			= "Pesquisando <allow-http-request-headers-from> nos arquivos de diretiva para autorizar o envio do cabeçalho para o URL %s pelo solicitante de %s";
"IDS_CONSOLE_QUESTIONABLE_SCRIPTING"		= "-- Os URLs de execução de script do navegador só podem ser executados durante as funções getURL e navigateToURL.";
"IDS_CONSOLE_WARN_ALLOW_NEVER"				= "Aviso: AllowScriptAccess=\'never\' encontrado em HTML. Esta configuração é ineficaz e obsoleta. Consulte http://www.adobe.com/go/allowscriptaccess_br para obter detalhes.";
"IDS_CONSOLE_WARN_ALLOW_SAMEDOM"			= "Aviso: AllowNetworking=\'%s\' encontrado em HTML, com HTML e SWF no mesmo domínio. Esta configuração é ineficaz e obsoleta. Consulte http://www.adobe.com/go/allowscriptaccess_br para obter detalhes.";
"IDS_CONSOLE_WARN_3D_SURFACE_TOO_BIG"		= "Aviso: 3D DisplayObject não será processado. Suas dimensões (%s, %s) são muito grandes para serem desenhadas.";
"IDS_CONSOLE_WARN_FILTER_TOO_BIG"			= "Aviso: o filtro não será processado.  As dimensões filtradas de DisplayObject (%s, %s) são muito grandes para serem desenhadas.";
"IDS_CONSOLE_FORCE_DOWNLOAD_WAS_SET"		= "Falha ao tentar carregar %s porque Content-Disposition estava definido como attachment.";
"IDS_CONSOLE_USER_ACTION_REQUIRED"			= "Certas ações, como aquelas que exigem uma janela pop-up, só podem ser invocadas com interação do usuário, por exemplo, clicar com o mouse ou pressionar um botão.";
"IDS_LOCALCONNECTION_USERSCOPED_LOCKED"     = "O valor de LocalConnection.isPerUser não pode ser alterado porque já foi bloqueado por uma chamada para LocalConnection.connect, .send ou .close.";
"IDS_CONSOLE_POLICY_FILE_BAD_PF_URL"		= "Ignorando arquivo de política com URL inválido, que não é ASCII %s";
"IDS_CONSOLE_POLICY_FILE_BAD_DATA_URL"		= "Não é possível autorizar a operação para o URL não ASCII inválido %s";

"Quit_Adobe_Connect_LBL" = "Sair do Adobe Connect";
"Hide_Adobe_Connect_LBL" = "Ocultar Adobe Connect";

